Iebe54/Stm32F7-usbAudioController_PE2_2024_R0836826/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_qspi.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* the delay before the screensaver is activated */
#define SCREENSAVER_DELAY 30000

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c1;

I2S_HandleTypeDef hi2s2;
DMA_HandleTypeDef hdma_spi2_tx;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

SAI_HandleTypeDef hsai_BlockB1;
DMA_HandleTypeDef hdma_sai1_b;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */

// The buffer for the audio data
uint16_t dataToSend[200] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 123, 123};
// tick for touchscreen
uint32_t ulSysTick_Old_Time = 0;
// reset button
uint8_t ucResetButton;
//left slider
uint16_t left_slider = 100;
//right slider
uint16_t right_slider = 100;
//touch delay
uint32_t touch_delay = 1000;
//volume control
uint8_t volumeControl[16];
//channel select
uint8_t channelSelect = 2;
//channel volume
uint8_t channelVolume[8] = {100, 100, 100, 100, 100, 100, 100, 100};
/* USER CODE END PV */



/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_LTDC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2S2_Init(void);
static void MX_DMA2D_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_FMC_Init(void);
static void MX_SAI1_Init(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/*This function will send the characters from printf via UART1.*/
/*Modified so you don't have to type \r\n anymore, just type \n.*/
int _write(int file, char *ptr, int len) {
    for (int i = 0; i < len; i++) {
        if (ptr[i] == '\n') {
            HAL_UART_Transmit(&huart1, (uint8_t *) "\r", 1, HAL_MAX_DELAY);
        }
        HAL_UART_Transmit(&huart1, (uint8_t *) &ptr[i], 1, HAL_MAX_DELAY);
    }
    return len;
}


/*This function will check if the screensaver needs to be on or not.*/
/*It will disable the screen if no fingers are detected after SCREENSAVER_DELAY*/
void checkScreensaver(void) {
    static uint32_t ScreensaverStart = SCREENSAVER_DELAY + 100;
    static uint8_t screensaver_status = 0;
    if (ScreensaverStart < HAL_GetTick() && screensaver_status == 0) {
        //Screen saver on -> display Off
        HAL_GPIO_WritePin(LCD_DISP_GPIO_Port, LCD_DISP_Pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_Port, LCD_BL_CTRL_Pin, GPIO_PIN_RESET);
        screensaver_status = 1;
        printf("Screensaver: on\n");
    }
    TS_StateTypeDef TS_State;
    BSP_TS_GetState(&TS_State);
    if (TS_State.touchDetected > 0) {
        //new start value
        ScreensaverStart = HAL_GetTick() + SCREENSAVER_DELAY;
        if (screensaver_status == 1) {
            HAL_GPIO_WritePin(LCD_DISP_GPIO_Port, LCD_DISP_Pin, GPIO_PIN_SET);
            HAL_Delay(100);
            HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_Port, LCD_BL_CTRL_Pin, GPIO_PIN_SET);
            screensaver_status = 0;
            printf("Screensaver: off\n");
        }
    }
}

/*the function to read the touch screen*/
uint8_t ReadTouch(uint8_t ucResetButton) {
    uint32_t ulSysTick_New_Time;
    TS_StateTypeDef TS_State;
    BSP_TS_GetState(&TS_State);
    while (TS_State.touchDetected == 1) {
        BSP_TS_GetState(&TS_State);
        ulSysTick_New_Time = HAL_GetTick();
        if (ulSysTick_New_Time >= (ulSysTick_Old_Time )) {
            ucResetButton = 0;
            if ((TS_State.touchX[0] <= 125) && (TS_State.touchX[0] >= 80) && (TS_State.touchY[0] <= 155) && (TS_State.touchY[0] >= 110)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("left and right channel locked\n");
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 315) && (TS_State.touchX[0] >= 270) && (TS_State.touchY[0] <= 85) && (TS_State.touchY[0] >= 40)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 1 selected \n");
                channelSelect = 1;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 315) && (TS_State.touchX[0] >= 270) && (TS_State.touchY[0] <= 137) && (TS_State.touchY[0] >= 92)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 2 selected \n");
                channelSelect = 2;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 315) && (TS_State.touchX[0] >= 270) && (TS_State.touchY[0] <= 189) && (TS_State.touchY[0] >= 144)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 3 selected \n");
                channelSelect = 3;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 315) && (TS_State.touchX[0] >= 270) && (TS_State.touchY[0] <= 241) && (TS_State.touchY[0] >= 196)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 4 selected \n");
                channelSelect = 4;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 385) && (TS_State.touchX[0] >= 340) && (TS_State.touchY[0] <= 85) && (TS_State.touchY[0] >= 40)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 5 selected \n");
                channelSelect = 5;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 385) && (TS_State.touchX[0] >= 340) && (TS_State.touchY[0] <= 137) && (TS_State.touchY[0] >= 92)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 6 selected \n");
                channelSelect = 6;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 385) && (TS_State.touchX[0] >= 340) && (TS_State.touchY[0] <= 189) && (TS_State.touchY[0] >= 144)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 7 selected \n");
                channelSelect = 7;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 385) && (TS_State.touchX[0] >= 340) && (TS_State.touchY[0] <= 241) && (TS_State.touchY[0] >= 196)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("channel 8 selected \n");
                channelSelect = 8;
                HAL_Delay(touch_delay);
            }
            if ((TS_State.touchX[0] <= 65) && (TS_State.touchX[0] >= 20) && (TS_State.touchY[0] <= left_slider+25) && (TS_State.touchY[0] >= left_slider-10)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("left slider selected \n");
                left_slider = TS_State.touchY[0];
                BSP_LCD_SelectLayer(1);
                BSP_LCD_Clear(LCD_COLOR_WHITE);
                //individual slidyboy
                BSP_LCD_FillRect(395, channelVolume[channelSelect], 45, 20);
                //left slidyboy
                BSP_LCD_FillRect(20, left_slider, 45, 20);
                //right slidyboy
                BSP_LCD_FillRect(135, right_slider, 45, 20);
            }
            if ((TS_State.touchX[0] <= 180) && (TS_State.touchX[0] >= 135) && (TS_State.touchY[0] <= right_slider+25) && (TS_State.touchY[0] >= right_slider-10)) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("right slider selected \n");
                right_slider = TS_State.touchY[0];
                BSP_LCD_SelectLayer(1);
                BSP_LCD_Clear(LCD_COLOR_WHITE);
                //individual slidyboy
                BSP_LCD_FillRect(395, channelVolume[channelSelect], 45, 20);
                //left slidyboy
                BSP_LCD_FillRect(20, left_slider, 45, 20);
                //right slidyboy
                BSP_LCD_FillRect(135, right_slider, 45, 20);
            }
            if ((TS_State.touchX[0] <= 440) && (TS_State.touchX[0] >= 395) && (TS_State.touchY[0] <= (volumeControl[channelSelect]+25)) && (TS_State.touchY[0] >= (volumeControl[channelSelect]-10))) {
                ulSysTick_Old_Time = ulSysTick_New_Time;
                printf("individual slider selected \n");
                volumeControl[channelSelect] = TS_State.touchY[0];
                BSP_LCD_SelectLayer(1);
                BSP_LCD_Clear(LCD_COLOR_WHITE);
                //individual slidyboy
                BSP_LCD_FillRect(395, channelVolume[channelSelect], 45, 20);
                //left slidyboy
                BSP_LCD_FillRect(20, left_slider, 45, 20);
                //right slidyboy
                BSP_LCD_FillRect(135, right_slider, 45, 20);
            }
            else {
                printf("Touch initialised\n");
            }
        } else {
            printf("Touch initialise could not be completed\n");
        }
    }
    for (int i = 0; i < 16; ++i) {
        if (i%2 != 0) {
            volumeControl[i] = channelVolume[i/2];
        } else {
        }
    }
    for (int i = 0; i < sizeof(channelVolume); ++i) {
        printf("adress: %d, Channel volume: %d\n", volumeControl[i*2], volumeControl[(i*2)+1]);
    }
    HAL_I2C_Master_Transmit(&hi2c1, 0x90, (uint8_t *) volumeControl, 16, HAL_MAX_DELAY);
    return ucResetButton;
}

